//import java.util.Scanner;

public class App {
    public static void main(String[] args) {
        
        //Дано прямокутну матрицю розмірності . 
        //Утворити вектор, кожен елемент якого дорівнює максимальному 
        //простому елементові відповідного стовпця матриці
        //tasks.task1();


        //Дано послідовність слів, розділених комами. Видрукувати слова, попередньо перетворивши 
        //кожне із них за правилом: вилучити всі наступні входження першої літери (при цьому першу літеру залишаємо).
        //tasks.task2();


        //Створити абстрактний базовий клас товар (назва, виробник, ціна) та 
        //похідні класи продовольчий товар (вага, термін зберігання) і одяг (тканина, розмір).
        //Дано масив посилань на об’єкти товарів (похідних класів).
        //− Посортувати його за ціною.
        //− Знайти одяг вказаного розміру.
        //− Вивести продовольчі товари з максимальним терміном придатності.
        //tasks.task3();
    }
}
